-- ===================================
-- DATA TYPE
-- ===================================
/*

## 숫자형 (정수/실수)

| 자료형          | 설명                          | 예시 값           |
|------------------|-------------------------------|-------------------|
| `TINYINT`        | 1바이트 정수 (-128~127)       | 100               |
| `SMALLINT`       | 2바이트 정수 +- 655535        | 30000             |
| `INT`, `INTEGER` | 4바이트 정수 +- 21.4억        | 1,000,000         |
| `BIGINT`         | 8바이트 정수 +- 933경         | 9,000,000,000     |
| `FLOAT(M,D)`     | 소수점 포함 실수 (4바이트)     | 3.14 소수점 8        |
| `DOUBLE`         | 더 정밀한 실수 (8바이트) | 3.1415926535  소수점 16(2배, 그래서 double임)|
| `DECIMAL(M,D/10진수)| 고정 소수점 숫자 (금액 표현용) | 12345.67          |

---

## 문자열형 character == 문자

| 자료형        | 설명                              | 예시               |
|----------------|-----------------------------------|--------------------|
| `CHAR(n)`      | 고정 길이 문자열 (n자) 반환작업X 속도 빠름 | `'Y'`, `'YES'`     |
| `VARCHAR(n)`   | 가변 길이 문자열 (n자까지) 반환작업 O 속도 느림 | `'Hello world'`    |
| `TEXT`         | 긴 텍스트 (최대 65,535자)         | 긴 설명글          |
| `ENUM`         | 지정된 값 중 하나만 저장 가능     | `'male'`, `'female'` |

# char 예시 : 주민등록번호, 전화번호 등 고정된 값이 있는걸 사용할때


---

## 날짜/시간형

| 자료형       | 설명                           | 예시                    |
|--------------|--------------------------------|-------------------------|
| `DATE`       | 날짜 (YYYY-MM-DD)              | `'2025-04-18'`          |
| `TIME`       | 시간 (HH:MM:SS)                | `'14:30:00'`            |
| `DATETIME`   | 날짜 + 시간                    | `'2025-04-18 14:30:00'` |
| `TIMESTAMP`  | UNIX 타임스탬프 기반 날짜/시간 | `'2025-04-18 14:30:00'` |
| `YEAR`       | 연도 (4자리)                   | `'2025'`                |

*/

select now(); #현재 시간 조회
select current_date, current_time();
select current_timestamp


# 한 줄 주석
#  -- 한줄 주석
 /*

범위 주석 == 위의 /* 부터 아래 * 까지

  */

-- === TABLE ===
/*
 - 데이터(값)을 보관하는 주체
 - 항상 row(행), column(열)로 이루어져 있음
 - database(schema) 하위에만 존재 가능
 */

select * from tbl_category; # 뒤에 있는거부터 해석
select * from tbl_menu;
select * from tbl_order;
select * from tbl_order_menu;
select * from tbl_payment;
select * from tbl_payment_order;

# 테이블 구조 조회(컬럼명, 자료형, 제약조건, 추가설정)
desc tbl_menu;