## 노선 유형 테이블 ROUTE_TY============================================

INSERT INTO ROUTE_TY VALUES ('1', '공항'),
                       ('2', '마을'),
                       ('3', '간선'),
                       ('4', '지선'),
                       ('5', '순환'),
                       ('6', '광역'),
                       ('7', '인천'),
                       ('8', '경기'),
                       ('10', '관광');


## 연령대 테이블 AGE=====================================================
INSERT INTO AGE VALUES (1, '일반'),
                       (2, '청소년'),
                       (3, '어린이');

## 요금 정보 테이블 price - (1)==========================================
ALTER TABLE `price` MODIFY COLUMN `price` VARCHAR(10) NOT NULL COMMENT '요금';
INSERT INTO price VALUES (1, '1', '거리 비례 요금'),
                         (2, '1', '거리 비례 요금'),
                         (3, '1', '거리 비례 요금');

## 요금 정보 테이블 price - (2)
INSERT INTO price VALUES (1, '2', '1200'),
                         (2, '2', '600'),
                         (3, '2', '400');

## 요금 정보 테이블 price - (3);
INSERT INTO price VALUES (1, '3', '1500'),
                         (2, '3', '900'),
                         (3, '3', '550');

## 요금 정보 테이블 price - (4)
INSERT INTO price VALUES (1, '4', '1500'),
                         (2, '4', '900'),
                         (3, '4', '550');

## 요금 정보 테이블 price - (5)
INSERT INTO price VALUES (1, '5', '1400'),
                         (2, '5', '800'),
                         (3, '5', '500');

## 요금 정보 테이블 price - (6)
INSERT INTO price VALUES (1, '6', '3000'),
                         (2, '6', '1700'),
                         (3, '6', '1500');

## 요금 정보 테이블 price - (7)
INSERT INTO price VALUES (1, '7', '1500'),
                         (2, '7', '1050'),
                         (3, '7', '600');

## 요금 정보 테이블 price - (8)
INSERT INTO price VALUES (1, '8', '1650'),
                         (2, '8', '1160'),
                         (3, '8', '830');


## 요금 정보 테이블 price - (10)
INSERT INTO price VALUES (1, '10', '관광지별 상이'),
                         (2, '10', '관광지별 상이'),
                         (3, '10', '관광지별 상이');


## area_code -> AUTO INCREMENT 설정=======================================
-- 1. FK 제거
ALTER TABLE `AREA` DROP FOREIGN KEY `FK_AREA_NAME_TO_AREA_1`;

-- 2. AUTO_INCREMENT 변경
ALTER TABLE `AREA_NAME` MODIFY `area_code` INT NOT NULL AUTO_INCREMENT;

-- 3. FK 다시 추가
ALTER TABLE `AREA` ADD CONSTRAINT `FK_AREA_NAME_TO_AREA_1`
    FOREIGN KEY (`area_code`) REFERENCES `AREA_NAME`(`area_code`);

## AREA_NAME 테이블 INSERT===============================================
INSERT INTO AREA_NAME(area_name) VALUES
('서울'),
('인천'),
('수원'),
('성남'),
('과천'),
('의정부'),
('안양'),
('군포'),
('부천'),
('광명'),
('평택'),
('안산'),
('고양'),
('구리'),
('남양주'),
('오산'),
('시흥'),
('의왕'),
('하남'),
('용인'),
('파주'),
('이천'),
('안성'),
('김포'),
('화성'),
('광주'),
('양주'),
('포천'),
('연천'),
('가평'),
('양평');

# AREA 테이블 INSERT=======================================
INSERT INTO AREA(area_id, area_code) VALUES
('-', 1),
('3', 1),
('100', 1),
('101', 1),
('102', 1),
('105', 1),
('106', 1),
('107', 1),
('108', 1),
('109', 1),
('110', 1),
('111', 1),
('113', 1),
('114', 1),
('115', 1),
('116', 1),
('117', 1),
('121', 1),
('122', 1),
('123', 1),
('124', 1),
('523', 1),
('161', 2),
('164', 2),
('165', 2),
('166', 2),
('168', 2),
('169', 2),
('200', 3),
('204', 4),
('205', 4),
('206', 5),
('207', 6),
('208', 7),
('209', 8),
('210', 9),
('213', 10),
('214', 11),
('216', 12),
('217', 12),
('218', 13),
('219', 13),
('241', 13),
('221', 14),
('222', 15),
('223', 16),
('224', 17),
('225', 18),
('226', 18),
('227', 19),
('228', 20),
('229', 21),
('230', 22),
('231', 23),
('232', 24),
('233', 25),
('234', 26),
('235', 27),
('236', 28),
('238', 29),
('239', 30),
('240', 31);