## 노선 유형 테이블 ROUTE_TY

INSERT INTO ROUTE_TY VALUES ('1', '공항'),
                       ('2', '마을'),
                       ('3', '간선'),
                       ('4', '지선'),
                       ('5', '순환'),
                       ('6', '광역'),
                       ('7', '인천'),
                       ('8', '경기'),
                       ('10', '관광');

## 요금 정보 테이블 price - (1)
ALTER TABLE `price` MODIFY COLUMN `price` VARCHAR(10) NOT NULL COMMENT '요금';
INSERT INTO price VALUES ('일반', '1', '거리 비례 요금'),
                         ('청소년', '1', '거리 비례 요금'),
                         ('어린이', '1', '거리 비례 요금');

## 요금 정보 테이블 price - (2)
INSERT INTO price VALUES ('일반', '2', '1200'),
                         ('청소년', '2', '600'),
                         ('어린이', '2', '400');

## 요금 정보 테이블 price - (3);
INSERT INTO price VALUES ('일반', '3', '1500'),
                         ('청소년', '3', '900'),
                         ('어린이', '3', '550');

## 요금 정보 테이블 price - (4)
INSERT INTO price VALUES ('일반', '4', '1500'),
                         ('청소년', '4', '900'),
                         ('어린이', '4', '550');

## 요금 정보 테이블 price - (5)
INSERT INTO price VALUES ('일반', '5', '1400'),
                         ('청소년', '5', '800'),
                         ('어린이', '5', '500');

## 요금 정보 테이블 price - (6)
INSERT INTO price VALUES ('일반', '6', '3000'),
                         ('청소년', '6', '1700'),
                         ('어린이', '6', '1500');

## 요금 정보 테이블 price - (7)
INSERT INTO price VALUES ('일반', '7', '1500'),
                         ('청소년', '7', '1050'),
                         ('어린이', '7', '600');

## 요금 정보 테이블 price - (8)
INSERT INTO price VALUES ('일반', '8', '1650'),
                         ('청소년', '8', '1160'),
                         ('어린이', '8', '830');


## 요금 정보 테이블 price - (4)
INSERT INTO price VALUES ('일반', '10', '관광지별 상이'),
                         ('청소년', '10', '관광지별 상이'),
                         ('어린이', '10', '관광지별 상이');